0.1.0/tutorials/heat-transfer/buoyant-simple/hot_radiation_room_fv_dom/0/p_rgh
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 100000;

boundaryField
{
  floor
  {
    type            fixedFluxPressure;
    value           uniform 100000;
  }
  ceiling
  {
    type            fixedFluxPressure;
    value           uniform 100000;
  }
  fixedWalls
  {
    type            fixedFluxPressure;
    value           uniform 100000;
  }
  box
  {
    type            fixedFluxPressure;
    value           uniform 100000;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
