0.1.0/tutorials/heat-transfer/buoyant-simple/hot_radiation_room_fv_dom/0/G
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      G;
}

dimensions      [1 0 -3 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  ".*"
  {
    type            MarshakRadiation;
    T               T;
    emissivityMode  lookup;
    emissivity      uniform 1.0;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
