0.1.0/tutorials/heat-transfer/buoyant-simple/hot_radiation_room_fv_dom/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p_rgh
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0.01;
  }
  Ii
  {
    solver              GAMG;
    tolerance           1e-4;
    relTol              0;
    smoother            symGaussSeidel;
    cacheAgglomeration  true;
    nCellsInCoarsestLevel   10;
    agglomerator        faceAreaPair;
    mergeLevels         1;
    maxIter             5;
    nPreSweeps          0;
    nPostSweeps         1;
  }
  "(U|h|k|epsilon)"
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
  residualControl
  {
    p_rgh           1e-2;
    U               1e-3;
    h               1e-3;
    G               1e-3;
    // possibly check turbulence fields
    "(k|epsilon|omega)" 1e-3;
    "ILambda.*"     1e-3;
  }
}
relaxationFactors
{
  fields
  {
    rho             1.0;
    p_rgh           0.7;
  }
  equations
  {
    U               0.2;
    h               0.2;
    k               0.5;
    epsilon         0.5;
    "ILambda.*"     0.7;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
